read -sv "../src/fifo_bram.v" "../src/rw_top.v"
synth_xilinx -flatten -nodsp 
clean
write_verilog "post_synth_results.v"
write_edif "netlist.edif"
tee -q -o post_synth_report.txt stat